DELETE FROM Country;
INSERT INTO Country (Name, Capital, Continent, Region, SurfaceArea, IndeptYear, Population, LifeExpectancy, GDP, LocalName, GovernmentForm, PoliticalSystem, GCR, CodeISO) VALUES
	 ('Аруба',                     'Ораньєст ', 	   'Північна Америка', 	   'Кариби', '180', '0', '107265', '78', '28863', 'Аруба', 'Не метрополія', NULL, '982', 'AW'),
	 ('Афганістан',                'Кабул',     	   'Азія',             	   'Південно-центральна Азія', '652864', '1919', '39232003', '53.7', '507', 'Афганістан', 'Абсолютна монархія', 'Унітарна теократична ісламська держава', '6500', 'AF'),
	 ('Ангола',                    'Луанда',    	   'Африка',           	   'Південна Африка', '1276700', '1975', '37290193', '62.1', '4101', 'Ангола', 'Президентська республіка', 'Унітарна держава', '23000', 'AO'),
	 ('Ангілья',                   'Валлі',     	   'Північна Америка', 	   'Кариби', '91', '0', '18090', '82.2', '4260', 'Ангілья', 'Не метрополія', NULL, '0', 'AI'),
	 ('Албанія',                   'Тирана',           'Європа',		       'Південна Європа', '27748', '1912', '2862427', '79.5', '5284', 'Шкіперія', 'Парламентська республіка', 'Унітарна держава', '3764', 'AL'),
	 ('Андорра',                   'Андорра-ла-Велья', 'Європа', 			   'Південна Європа', '468', '1278', '76177', '83.4', '53383', 'Андорра', 'Парламентська демократія і Князівство', 'Унітарна держава', '0', 'AD'),
	 ('Нідерланди', 	       'Амстердам',        'Європа', 			   'Західна Європа', '41526', '1648', '17333790', '82.2', '38618', 'Нідерланди', 'Парламентська конституційна монархія', 'Унітарна держава', '37966', 'NL'),
	 ('Обєднані Арабські Емірати', 'Абу-Дабі', 	       'Азія', 				   'Західна Азія', '83600', '1971', '9992083', '79.6', '27700', 'Емірати', 'Федерація абсолютних монархій', 'Суверенна абсолютна монархія', '106700', 'AE'),
	 ('Аргентина',                 'Буенос-Айрес',     'Америка', 			   'Південна Америка', '2780400', '1816', '47327407', '78.3', '9054', 'Аргентина', 'Президентська республіка', 'Федеративна держава', '54100', 'AR'),
	 ('Вірменія',                  'Єреван ', 	       'Азія', 				   'Кавказ', '29800', '1991', '2791000', '76.1', '4270', 'Гаястан', 'Парламентсько-президентська республіка', 'Унітарна держава', '2850', 'AM'),
	 ('Самоа',                     'Аліа', 	           'Австралія та Океаіня', 'Полінезія', '2832', '1962', '187820', '75.2', '4231', 'Самоа', 'Конституційна монархія', 'Унітарна держава', '185', 'WS'),
	 ('Австралійський союз',       'Канберра',         'Австралія та Океанія', 'Австралазія', '7688287', '1901', '25250000', '83.1', '59655', 'Австралія', 'Конституційна монархія', 'Федеративна держава', '48430', 'AU'),
	 ('Японія',                    'Токіо',            'Азія',  			   'Східна Азія', '377972', '1951', '126476461', '84.8', '39306', 'Ніхон коку', 'Парламентська конституційна монархія', 'Унітарна держава', '1340058', 'JP'),
	 ('Алжир',                     'Алжир ',           'Африка',			   'Північна Африка', '2381740', '1962', '45400000', '78', '3898', 'Алжир', 'Президентсько-парламентська республіка', 'Унітарна держава', '71798', 'DZ'),
	 ('Гренладнія',                'Нуук',             'Антарктида', 		   'Антарктида', '2381740', '0', '56968', '74', '19000', 'Калаалліт', 'Не метрополія', NULL, '0', 'GL');

-- 1)--------------------------------------------------------------------------------------------------
SELECT * FROM Country
WHERE Continent IN ('Європа', 'Африка');
-- 2)--------------------------------------------------------------------------------------------------
SELECT Name AS CountryName, Continent AS ContinentName, LifeExpectancy AS AvgLifeExpectancy
FROM Country
WHERE LifeExpectancy BETWEEN 80 AND 89;
-- 3)--------------------------------------------------------------------------------------------------
SELECT Name, GovernmentForm FROM Country
WHERE GovernmentForm LIKE 'Пар%-%'
OR    GovernmentForm LIKE 'Пре%-%';
-- 4)--------------------------------------------------------------------------------------------------
SELECT Continent, COUNT(*) AS NumberOfCountries
FROM Country
WHERE Continent IN ('Європа', 'Африка')
GROUP BY Continent;
-- 5)--------------------------------------------------------------------------------------------------
SELECT Continent, AVG(Population / SurfaceArea) AS AvgPopulationDensity
FROM Country
WHERE Continent IN ('Європа', 'Африка')
GROUP BY Continent;
-- 6)--------------------------------------------------------------------------------------------------
SELECT Region, AVG(LifeExpectancy) AS AvgLifeExpectancy
FROM Country
GROUP BY Region
ORDER BY AvgLifeExpectancy DESC;
-- 7)--------------------------------------------------------------------------------------------------
SELECT * FROM Country
WHERE GDP < (SELECT AVG(GDP) FROM Country WHERE Continent = 'Америка');
-- 8)--------------------------------------------------------------------------------------------------
SELECT Name, Continent, LifeExpectancy 
FROM Country
WHERE Continent IN ('Європа', 'Африка') 
    AND LifeExpectancy < (SELECT AVG(LifeExpectancy) 
    FROM Country WHERE Continent = 'Азія')
ORDER BY LifeExpectancy ASC;
-- --------------------------------------------------------------------------------------------------